text = 'Ну, вышел я,  из подъезда. В общем, короче говоря, шел я, кажется, в магазин. Ну,эээ, в общем, было лето, кажется. Как бы тепло. Солнечно, короче. Иду я, иду, в общем, по улице, а тут, короче, яма. Я, эээээ…. Упал в нее. И снова вышел, короче, из подъезда. Ясен пень, в магазин. В общем, лето на дворе, жарко, солнечно, птицы, короче, летают. Кстати, иду я по улице, иду, а тут, короче, яма. Ну, я в нее упал, в общем.Вышел из подъезда, короче. Лето на дворе, ясен пень. Птицы поют, короче, солнечно. В общем, в магазин мне надо.Что-то явно не так, короче. «Рекурсия», - подумал я. Ээээ...короче, в общем, пошел другой дорогой и не упал в эту… ээээ… яму. Хлеба купил'
bad_words = ['ну', 'В общем', 'короче говоря', 'кажется', 'иду я','ээ','_э' ,'короче,', ',кажется', 'в общем', 'ясен пень', 'как бы', 'кстати', 'короче', '... ,', '….','…', '...',', ,', ', _', '_,' ]

for word in bad_words:
    text = text.casefold().replace(word, '_')

text = text.replace('я,','я')
text = text.replace('_','')
text = text.replace('  ',' ')
text = text.split('.')

final_sentences = []
for sentence in text:
  sentence = sentence.strip()
  if not sentence:
    continue
  sentence = sentence.capitalize()
  final_sentences.append(sentence)

final_text = '. '.join(final_sentences)
final_text = final_text  + '.'
print(final_text)